// 日称。
const daytime= [];
daytime[0]= ['中夜', '鸡鸣', '平旦', '日出', '朝食', '日禺', '日中', '日跌', '夕食', '日落', '日暮', '初夜']
daytime[1]= ['三更', '夜半']
daytime[2]= ['四更', '荒鸡']
daytime[3]= ['五更', '黎明']
daytime[4]= ['旭升', '破晓']
daytime[5]= ['朝昼', '燕语']
daytime[6]= ['禺昼', '禺中']
daytime[7]= ['中昼', '午正']
daytime[8]= ['晡昼', '日央']
daytime[9]= ['夕昼', '日晡']
daytime[10]= ['昴夜', '今晚']
daytime[11]= ['初更', '黄昏']
daytime[12]= ['二更', '人定']

// 月令
// 月令（和名）
// 出云地区‘神有’。
const moonJp= ['初空', '梅见', '夜樱', '清和', '浴兰', '蝉羽', '凉月', '月见', '竹醉', '时雨', '神乐', '胧月']
const moonJp2= ['睦', '如', '弥生', '卯', '皋', '水无', '文', '叶', '长', '神无', '霜', '师走']
// 月令（花）
const moonFlower= ['梅', '樱', '藤花', '牡丹', '菖蒲', '朝颜', '百合', '桔梗', '菊', '红叶', '水仙', '椿']

// 季令
const season= []
season[0]= ['淑节', '朱律', '凄辰', '安宁'] // 四季
season[1]= ['首阳', '花潮', '莺时'] // 春
season[2]= ['乏月', '鸣蜩', '溽暑'] // 夏
season[3]= ['兰秋', '桂秋', '菊序'] // 秋
season[4]= ['飞阴', '龙潜', '清祀'] // 冬