

// 时刻。

/**
 * 五更分划：
 * 一更：申、酉
 * 二更：戌
 * 三更：亥
 * 四更：子
 * 五更：丑、寅
 */


// 时分。

/**
 * 时名，24小时对应各小时分划12组（即12时辰）。
 * 从子夜（11点开始）
 */
const dudek_kvar= [
  ["夜半", "中夜"],
  ["荒鸡", "鸡鸣"],
  ["黎明", "平旦"],
  ["破晓", "日出"],
  ["燕语", "朝食"],
  ["日禺", "隅中"],
  ["午正", "日中"],
  ["日央", "日跌"],
  ["日晡", "夕食"],
  ["傍晚", "日落"],
  ["黄昏", "日暮"],
  ["人定", "初夜"]
]
// 夏秋‘日末’换‘日曛’。
const dek_kvar= [
  "宵分", "未旦",
  "四更", "四更",
  "早夜", "昧爽",
  "旭升", "日晞",
  "朝昼", "宴食",
  "禺昼", "禺旦",
  "中昼", "日高亭午",
  "晡昼", "日斜",
  "夕昼", "日稷馎时",
  "昴夜", "日宴",
  "初更", "日末",
  "二更", "夤夜"
]


/**
 * 初正末。
 * 辰：辰初，辰正
 * 午：午初，午正，午末
 * 昏：昏初，昏正
 * 晚：晚时
 * 夜：夜初，夜正，夜末
 */
